## Handling Categorical Variables 
### One Hot Encoding

In [1]:
import pandas as pd

In [2]:
dft = pd.read_csv('titanic.csv',usecols=['Sex'])

In [3]:
dft

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [6]:
pd.get_dummies(dft)
# here colums sex is converted in to numerical using one hot encoding
# but when we have n Unique numbers  we take n-1 columns in one hot encoding 
# so we do drop first is true

     Sex_female  Sex_male
0             0         1
1             1         0
2             1         0
3             1         0
4             0         1
..          ...       ...
886           0         1
887           1         0
888           1         0
889           0         1
890           0         1

[891 rows x 2 columns]

In [10]:
pd.get_dummies(dft,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [11]:
dfe = pd.read_csv('titanic.csv',usecols=['Embarked'])

In [12]:
dfe

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[891 rows x 1 columns]

In [17]:
dfe['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [14]:
dfe.isnull().sum()
# as we have two null values we can replace them using most requent value or we can drop them 
# before proceeding to encoding we need to replce all null values

Embarked    2
dtype: int64

In [21]:
dfe.dropna()

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[889 rows x 1 columns]

In [23]:
pd.get_dummies(dfe,drop_first=True)
# as we have 3 unique numebers so we get 2 columns

     Embarked_Q  Embarked_S
0             0           1
1             0           0
2             0           1
3             0           1
4             0           1
..          ...         ...
886           0           1
887           0           1
888           0           1
889           0           0
890           1           0

[891 rows x 2 columns]

In [4]:
import pandas as pd 
dfp = pd.read_csv('titanic.csv',usecols=['Sex','Embarked','Cabin'])

In [5]:
dfp

        Sex Cabin Embarked
0      male   NaN        S
1    female   C85        C
2    female   NaN        S
3    female  C123        S
4      male   NaN        S
..      ...   ...      ...
886    male   NaN        S
887  female   B42        S
888  female   NaN        S
889    male  C148        C
890    male   NaN        Q

[891 rows x 3 columns]

In [7]:
dfp.isnull().sum()

Sex           0
Cabin       687
Embarked      2
dtype: int64

In [8]:
dfp.Cabin.isnull().mean()

0.7710437710437711

In [19]:
pp = dfp['Embarked'].value_counts().index[0]

In [20]:
dfp['Embarked'].fillna(pp,inplace=True)

In [21]:
dfp.isnull().sum()

Sex           0
Cabin       687
Embarked      0
dtype: int64

In [22]:
dfp.isnull().mean()

Sex         0.000000
Cabin       0.771044
Embarked    0.000000
dtype: float64